Tekla.Structures.Drawing.ReinforcementBase
The ReinforcementBase class contains methods related to reinforcements.
A reinforcement is a drawing object derived from a model object.
It represents a drawing reinforcement that has a reference to the
actual reinforcement in the model database.

Tekla.Structures.Drawing.ReinforcementBase.Attributes
The common attributes of all reinforcements.
For more information see Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.

Tekla.Structures.Drawing.ReinforcementBase.Delete
Deletes the drawing reinforcement from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.ReinforcementBase.Modify
Modifies the drawing reinforcement in the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.ReinforcementBase.Insert
Inserts the drawing reinforcement into the current drawing database.
NOT YET IMPLEMENTED.
Returns: An exception.
Throws System.NotImplementedException: Reinforcements cannot be inserted yet.

Tekla.Structures.Drawing.ReinforcementBase.Select
Selects the drawing reinforcement from the current drawing database.
Returns: True on success.